Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །ཀླུའི་བདག་པོ་དེ་ལྟ་བས་ན་རྣམ་གྲངས་འདིས་ཀྱང་ཁྱོད་ཀྱིས་འདི་ལྟར་ཟབ་ཅིང་ངའོ་སྙམ་པའི་ང་རྒྱལ་ལས་རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་རྟོག་པས་བྱས་པ། རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བ། སེམས་ཅན་དང་སྲོག་དང་། གསོ་བ་དང་། གང་ཟག་ཏུ་རྟོག་པ་མེད་པའི་ཆོས་རྣམས་ལ་མོས་པ་དང་། དད་པ་དང་འཛིན་པ་དང་། གཞན་དག་ལ་ཡང་བརྡ་སྤྲོད་པར་བྱེད་པའི་སེམས་ཅན་དེ་དག་ཇི་ལྟར་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་པ་དང་། དེ་དག་ལ་ནི་བསོད་ནམས་ཀྱང་མང་དུ་འཕེལ་བར་འགྱུར་བ་དེ་ལྟར་རིག་པར་བྱའོ།
en: Therefore, Nāga Lord, you should understand that those who trained with thus-gone ones of former times are those who now trust, believe in, remember, and propagate such a teaching that is profound, free from the pride of thinking ‘me,’ and free from the belief in being, life force, a soul, and a person—which, due to being produced by vain imaginings, derive from causes and conditions. They will vastly multiply their merit.

source: །ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་རྣམས་ཀྱི་ཕན་པ་དང་བདེ་བའི་དོན་ལ་ཞུགས་པ། གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་ལྷ་རྣམས་དང་། མི་རྣམས་ཀྱི་བདེ་བའི་ཡོ་བྱད་ཇི་སྙེད་ཡོད་པའི་བདེ་བའི་ཡོ་བྱད་དེ་སྙེད་སེམས་ཅན་རེ་རེ་ལ་བྱིན་ན།
en: “Nāga Lord, suppose bodhisattvas who are committed to the pursuit of the benefit and happiness of beings were to give to each and every being all the resources for happiness belonging to gods and humans present throughout the great trichiliocosm.

source: ཀླུའི་བདག་པོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: Nāga Lord, what do you think?

source: ཅི་བྱང་ཆུབ་སེམས་དཔའ་དེས་སེམས་ཅན་དེ་དག་ལ་བདེ་བའི་ཡོ་བྱད་མང་པོ་བྱིན་པ་ཡིན་ནམ། གསོལ་པ།
en: Would that bodhisattva have given many resources for happiness to these beings?”

source: བཅོམ་ལྡན་འདས་མང་ལགས་སོ།
en: “Many indeed, Blessed One.

source: །བདེ་བར་གཤེགས་པ་མང་ལགས་སོ།
en: Many indeed, Well-Gone One.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་དེ་དག་ལ་བདེ་བའི་ཡོ་བྱད་དེ་སྙེད་བྱིན་པ་གང་ཡིན་པ་དང་། དེ་དག་ལ་མི་རྟག་པ་དང་ལྡན་པ་ཚིག་གཅིག་ཙམ་བསྟན་ཏམ། སྡུག་བསྔལ་བ་དང་ལྡན་པའམ། བདག་མེད་པ་དང་ལྡན་པའམ། ཞི་བ་དང་ལྡན་པའམ། སྟོང་པ་ཉིད་དང་ལྡན་པའམ། མཚན་མ་མེད་པ་དང་ལྡན་པའམ། སྨོན་པ་མེད་པ་དང་ལྡན་པའམ། སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གསོ་བ་མེད་པ་དང་། གང་ཟག་མེད་པ་དང་ལྡན་པའམ། མ་སྐྱེས་མ་བྱུང་བ་དང་ལྡན་པ་ཚིག་གཅིག་ཙམ་བསྟན་ན། དེ་ཉིད་དེས་བདེ་བའི་ཡོ་བྱད་དེ་བས་ཆེས་མང་དུ་བྱིན་པ་ཡིན་ཏེ།
en: The Blessed One continued, “Nāga Lord, compared to all the sense pleasures that those bodhisattvas would have given to beings, if they were to teach but one word of impermanence, suffering, selflessness, peace, emptiness, the absence of marks, the absence of wishes, the nonexistence of a being, the nonexistence of a life force, the nonexistence of a soul, the nonexistence of a person, non-birth, or nonarising, it would be a far greater gift than those resources for happiness.

source: བསོད་ནམས་ཀྱང་ཆེས་མང་དུ་འཕེལ་བར་འགྱུར་རོ།
en: It would cause his merit to increase much further.

source: ཀླུའི་བདག་པོ་འདུས་བྱས་ཀྱི་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ནི་སེམས་ཅན་རྣམས་ཀྱིས་སྔོན་མྱོང་ཟིན་གྱི་འདུས་མ་བྱས་ཀྱི་བདེ་བའི་ཡོ་བྱད་ནི་སེམས་ཅན་རྣམས་ཀྱིས་སྔོན་མ་མྱོང་བའི་ཕྱིར་རོ།
en: Because, Nāga Lord, beings have already experienced all the conditioned resources for happiness, while they have not yet experienced unconditioned resources for happiness.

source: །ཀླུའི་བདག་པོ་དེ་ལ་འདི་ལྟར་ཟབ་པའི་ཆོས་འདི་དག་ཐོས་པ་གང་ཡིན་པ་འདི་ནི་འདུས་མ་བྱས་ཀྱི་བདེ་བའི་ཡོ་བྱད་འདྲེན་པ་ཡིན་ཏེ།
en: Nāga Lord, these profound teachings that they hear of will lead them to unconditioned pleasures.

source: དེ་བས་ན་ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་བདག་གི་དོན་དང་། གཞན་གྱི་དོན་ཡོངས་སུ་རྫོགས་པར་བྱེད་འདོད་པ་རྣམས་ཀྱིས་ནི་ཆོས་ཟབ་མོ་རྣམས་ལ་བརྩོན་པར་བྱའོ། །ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་གྱི་ནང་དུ་འོངས་ལ། འཁོར་གྱི་ནང་དུ་འདུག་ནས་ཟབ་མོའི་གཏམ་གྱི་བར་ཆད་བྱེད་དེ།
en: Therefore, Nāga Lord, bodhisattvas who wish to perfect the benefit of both themselves and others should devote themselves to profound teachings.

source: གཏམ་སྣ་ཚོགས་གླེང་བ་གང་ཡིན་པ་དེ་ནི་དམ་པའི་ཆོས་ནུབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་པ་ཡིན་ན།
en: “Nāga Lord, if bodhisattvas join the assembly and obstruct the profound teachings, all the things they say are devoted to making the sublime Dharma decline.

source: འཛམ་བུའི་གླིང་འདིར་ཇི་སྲིད་དུ་ཟབ་མོའི་ཆོས་གྲགས་པ་དེ་སྲིད་དུ་དམ་པའི་ཆོས་ནུབ་པར་མི་འགྱུར་བའི་ཕྱིར་རོ།
en: As long as this profound teaching is heard here in Jambudvīpa, the sublime Dharma will not disappear.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་མི་ཆོས་འདོད་དེ། ཆོས་ཉན་པ་ནི་ཉུང་ལ་མི་མ་ཡིན་པའི་ཆོས་ཉན་པ་ནི་མང་སྟེ།
en: Moreover, Nāga Lord, there are few human beings who yearn for and listen to Dharma, whereas there are many nonhuman beings who listen to Dharma.

source: དེར་དམ་པའི་ཆོས་སྨྲ་བ་པོ་གང་གིས་ཟབ་མོའི་གཏམ་ནི་འཆབ་པར་བྱེད་ལ་གཏམ་སྣ་ཚོགས་ནི། གླེང་བར་བྱེད་ན་དེར་ཟབ་མོ་ལ་མོས་པས་ལྷ་རྣམས་ཡི་མ་རངས་པར་གྱུར་ཏེ།
en: So if preachers of the profound Dharma conceal the profound teachings from them, discussing many other subjects instead, the gods who are devoted to profundity will not be pleased.

source: འདི་སྐད་དུ་རིགས་ཀྱི་བུ་འདི་ནི་གང་ཁོ་ན་ལ་འཇིག་རྟེན་པ་ཉོན་མོངས་པ་སྤྱོད་པ་དེ་ཉིད་ཀྱི་འཇིག་རྟེན་པའི་གཏམ་གླེང་ཞིང་འདུག་སྟེ།
en: They will lament, ‘This noble son is wholly engaged in worldly affliction. He is just sitting here spouting this worldly chatter.

source: ཀྱེ་རེ་ངན་འདི་ན་སངས་རྒྱས་ཀྱི་གསུང་མི་གྲག་གོ་ཞེས་ཚིག་ངན་འཐོན་ནས་དེ་དག་འཁོར་དེ་དག་ལ་མི་དགའ་སྟེ། འདོང་བར་བྱེད་དོ།
en: How sad that the Buddha’s speech is not being heard here!’ They will leave the assembly in dismay.”

source: །སྨོན་ལམ་གྱི་ལེའུ་སྟེ་གཉིས་པའོ།།
en: Chapter Two: Aspirations

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་ལ། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅི་འཇིག་རྟེན་པའི་སྦྱིན་པ་དང་། དུལ་བ་དང་། ལེགས་པར་སྡོམ་པ་དང་། དེས་པའི་གཏམ་དང་། རབ་ཏུ་འབྱུང་བ་དང་། ངེས་པར་འབྱུང་བའི་གཏམ་དང་། ཚངས་པར་སྤྱོད་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། བག་ཡོད་པ་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པའི་གཏམ་སངས་རྒྱས་ཀྱི་གསུང་མ་ལགས་སམ།
en: Then Nāga King Sāgara asked the Blessed One, “Blessed One, how could it be that discussions of worldly giving, restraint, vows, gentleness, going forth, emancipation, pure conduct, discipline, learning, carefulness, ascetic practices, and voluntary poverty are not the speech of the buddhas?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་ཆོས་གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འབྱུང་བར་འགྱུར་བ་དང་། འགོག་པར་འགྱུར་བའི་ཕྱིར་སྐྱེ་བ་མ་ཡིན་པ་ཁམས་གསུམ་ན་སྤྱོད་པ་ངེས་པར་འབྱུང་བར་འགྱུར་བ་མ་ཡིན་པ་དེ་དག་ཐམས་ཅད་ནི་འཇིག་རྟེན་པའི་ཡིན་གྱི།
en: The Blessed One answered, “Nāga Lord, any teaching that is not produced to give rise to blessed buddhas and to bring about cessation and does not lead to renunciation of involvement with the three realms is worldly.

source: དེ་དག་ནི་སངས་རྒྱས་ཀྱི་གསུང་མ་ཡིན་ནོ། །དེ་དག་ཀྱང་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: It is not buddha speech.

source: བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་དང་། འཇིག་རྟེན་པའི་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཤེས་པ་དང་། ཡི་གེ་དང་། གྲངས་དང་། བགྲང་བ་དང་། ལག་རྩིས་ཤེས་པ་དང་། འབྱུང་ཁུངས་ཤེས་པ་དང་། སྔགས་དང་། སྨན་དང་། གསོ་བ་ཤེས་པ་དང་། ལས་དང་བཟོའི་གནས་ཤེས་པ་དང་། མཚན་མ་དང་བཅས་པ་དང་། ཆེད་དུ་བྱ་བ་དང་བཅས་པ་དང་། ཟང་ཟིང་དང་བཅས་པ་དང་། རྒྱུ་བ་དང་བཅས་པ་དང་། རྫས་དང་བཅས་པ་ཤེས་པ་དང་། འཇིག་རྟེན་པ་དང་། ཁམས་གསུམ་ན་སྤྱོད་པ་གང་ཡིན་པ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་གསུང་མ་ཡིན་ནོ།
en: Those that fall into that category are the four concentrations, the four immeasurables, the four formless attainments, the five types of higher knowledges, the ten courses of virtuous action, and knowledge of worldly giving, discipline, patience, diligence, concentration, and insight. Also included here are knowledge of language, numbers, counting, and palmistry; knowledge of origins; knowledge of spells, medicine, and healing; and knowledge of crafts and manufacture. In this category are also those types of knowledge that involve marks, administration, material things, employment, physics, the world, and any other engagement with the three realms. All of these are not buddha speech.

source: །ཀླུའི་བདག་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འབྱུང་བར་འགྱུར་བའི་ཆོས་སྔོན་མ་ཐོས་པ་ལས་ཐོས་པ་གང་དག་ཡིན་པ་འདི་ལྟ་སྟེ་མི་རྟག་པའི་དོན་དང་། སྡུག་བསྔལ་བའི་དོན་དང་། བདག་མེད་པའི་དོན་དང་། ཞི་བའི་དོན་དང་། སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པའི་དོན་དང་། ཀུན་འབྱུང་བ་སྤོང་བའི་དོན་དང་། འགོག་པ་མངོན་སུམ་དུ་བྱ་བའི་དོན་དང་། ལམ་སྒོམ་པའི་དོན་དང་། སྟོང་པ་ཉིད་སྒོམ་པའི་དོན་དང་། མཚན་མ་མེད་པས་ངེས་པར་རྒལ་བའི་དོན་དང་། སྨོན་པ་མེད་པས་ངེས་པར་འབྱུང་བའི་དོན་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། མ་སྐྱེས་པ་དང་། མ་བྱུང་བའི་དོན་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་ཞི་གནས་དང་། ལྷག་མཐོང་གི་དོན་དང་། ཇི་ལྟ་བ་བཞིན་དུ་རང་བཞིན་གྱིས་མ་སྐྱེས་པའི་དོན་དང་། ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་དབེན་པའི་དོན་དང་། ཆོས་གང་རྗེས་སུ་རྟོགས་ནས་ཆོས་རྣམས་དང་། ཆོས་མ་ཡིན་པ་རྣམས་གཉིས་སུ་མི་འབྱེད་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱང་བསྟན་དུ་མངོན་པར་མི་འགྲུབ་པར་རབ་ཏུ་ཤེས་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། ཆད་པ་མེད་པ་དང་། རྟག་པ་མེད་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཐོབ་པ་རྣམས་དང་། རང་བཞིན་གྱིས་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པ་རྣམས་དང་། དེ་ལྟར་འདུས་མ་བྱས་པའི་ཆོས་མཐོང་བས་ཡང་དག་པར་ངེས་པ་ལ་འཇུག་ལ།
en: “Nāga Lord, what then are those teachings that give rise to blessed buddhas and that have not been heard of before? They are the meaning of impermanence, suffering, selflessness, and peace; the knowledge of suffering, the abandonment of its origin, the actualization of its cessation, and the cultivation of the path; the cultivation of emptiness, crossing over due to the absence of marks, and deliverance through the absence of wishes; the unconditioned, the unborn, and the nonarising; the four applications of mindfulness, the correct abandonments, the bases of miraculous absorption, the faculties, the strengths , and the branches of awakening; the path; tranquility and special insight; how things are unborn by nature; the voidness of the aggregates, the elements, and the sense sources; the indistinguishability of phenomena and non-phenomena once phenomena are understood; the knowledge of how no phenomenon can be positively identified; the unborn, the lack of interruption, and the lack of permanence; the attainment of dependent origination; the attainment of natural freedom from attachment; the development of certainty by seeing how things are unconditioned as previously described;

source: ཆོས་རྣམས་ཀྱི་ངེས་པ་ལ་ཡང་མི་རྟོག་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་དང་ཡང་བྲལ་བ་དང་། ཕྲི་བ་ཡང་མེད་བསྣན་པ་ཡང་མེད་པ་དང་། མུན་པ་ཡང་མེད་སྣང་བ་ཡང་མེད་པ་དང་། ནམ་མཁའི་ངོ་བོ་ཉིད་དང་མཉམ་པ་ཉིད་ཐོབ་པ་དང་། རང་བཞིན་གྱི་མཚན་ཉིད་དང་། མཉམ་པའི་མཚན་ཉིད་དང་། མཚན་ཉིད་མེད་པ་དང་། མཚན་ཉིད་མེད་པ་མ་ཡིན་པ་དང་། མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་དང་། འདུ་ཤེས་ཐམས་ཅད་དང་བྲལ་བ་དང་། རིག་པ་མེད་པ་དང་། ཚོར་བ་ཐམས་ཅད་རྒྱུན་གཅད་པ་དང་། ཕྱིན་ཅི་ལོག་མཉམ་པ་ཉིད་དུ་མཐོང་བ་ནི་ཐ་སྙད་ཀྱི་སྒོ་ནས་འབྲས་བུ་ཐོབ་པ་ཞེས་བྱ་སྟེ།
en: understanding that certainty with regard to phenomena is itself nonconceptual, free from imagination and conceptuality; the absence of increase and decrease; the absence of darkness and light; the achievement of equality with the nature of space; the lack of all characteristics of nature, characteristics of sameness, absence of characteristics, non-absence of characteristics, the singular characteristic of the absence of characteristics, and all notions; the absence of cognition; the interruption of all feeling; and seeing the mistaken as sameness, which is known as attaining the fruition by means of conventions.

source: དོན་དམ་པར་ནི་མ་ཡིན་པ་དང་། དེས་ཅི་ཡང་ཐོབ་པ་མེད་ལ།
en: “Still, they are not the ultimate.

source: མ་ཐོབ་པ་ཡང་མེད་པ་དང་། བླངས་པ་ཡང་མེད་བོར་བ་ཡང་མེད་པ་སྟེ།
en: In this way, there is nothing to obtain and nothing that is not obtained; there is nothing to adopt and nothing to discard.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་ན་ངེས་པར་འབྱུང་བའི་ཆོས་གང་དག་ཡིན་པ་རྣམས་སྟོན་ཅིང་འཆད་པ་གང་གིས་ཉན་ཐོས་རྣམས་ཀྱིས་ཉན་ཐོས་ཀྱི་ཤེས་པ་ཐོབ་པ་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱིས་རང་སངས་རྒྱས་རྣམས་ཀྱི་ཤེས་པ་འཐོབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་འཐོབ་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་འདི་ནི་སངས་རྒྱས་ཀྱི་གསུང་ཞེས་བྱའོ།
en: Nāga Lord, the teachings of emancipation taught or explained in this way lead the hearers to attain the hearers’ understanding, the solitary buddhas to attain the solitary buddhas’ understanding, and the bodhisattvas to reach the acceptance that phenomena are unborn and to fully awaken to the unsurpassed and perfect awakening of the thus-gone ones. Such teachings are then called buddha speech

source: །དེ་ཡང་ཀུན་རྫོབ་ཀྱི་གཞིའི་གནས་ལས་བརྟེན་པ་ཡིན་གྱི་དོན་དམ་པར་ནི་ཇི་ལྟར་ཡང་སངས་རྒྱས་ཀྱི་གསུང་ཐ་སྙད་དུ་གདགས་པར་མི་ནུས་ཏེ། སངས་རྒྱས་ཀྱི་གསུང་ནི་ཚིག་མེད་པའོ།
en: Moreover, these teachings rest on the basis of the relative, since on the ultimate level the convention buddha speech cannot be applied, as on that level buddha speech is wordless.

source: །སངས་རྒྱས་ཀྱི་གསུང་ནི་ངག་མེད་པ། སྒྲ་མེད་པ། ཚིག་གི་ལམ་མེད་པ། བརྗོད་དུ་མེད་པ། རྣམ་པར་རིག་པར་བྱེད་པ་མེད་པ། གདགས་པ་མེད་པ། མིང་མེད་པ། མཚན་མ་མེད་པ།
en: Buddha speech is voiceless, soundless, inexpressible, unutterable, uncommunicative, undesignated, unnamable, unmarked, uncategorizable, unconscious, inconceivable, and unfathomable.

source: བྱེ་བྲག་ཕྱེད་པ་མེད་པ། རྣམ་པར་ཤེས་པ་མེད་པ། བསམ་དུ་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འཇུག་པ་སྟེ། རབ་ཏུ་དབྱེ་བ་དང་། བརྡ་སྤྲད་པ་དང་། ཉེ་བར་བསྟན་པར་མི་ནུས་སོ།
en: It cannot be classified, communicated, or taught.

source: །ཀླུའི་བདག་པོ་སངས་རྒྱས་ཀྱི་གསུང་ནི་དེ་ལྟ་བུ་ཡིན་ནོ།
en: Nāga Lord, buddha speech is like that.

source: ཀླུའི་བདག་པོ་ང་ནི་ཡི་གེ་འདོད་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་མི་སྟོན་མོད་ཀྱི།
en: Nāga Lord, I certainly do not teach the Dharma to beings who are fond of words.

source: འོན་ཀྱང་ཡི་གེ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: Rather, I teach the Dharma so that words may be understood.

source: དེ་བས་ན་སངས་རྒྱས་ཀྱི་གསུང་ནི་ཡི་གེ་མེད་པའོ།
en: Therefore, buddha speech is without words.

source: །ཀླུའི་བདག་པོ་ང་ནི་བརྗོད་པ་འདོད་པ་ལ་ཆོས་མི་སྟོན་མོད་ཀྱི།
en: Nāga Lord, I certainly do not teach the Dharma to beings who are fond of speaking.

source: འོན་ཀྱང་བརྗོད་པ་ཐམས་ཅད་བསྩལ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ། དེ་བས་ན་སངས་རྒྱས་ཀྱི་གསུང་ནི་བརྗོད་དུ་མེད་པའོ།
en: Rather, I teach the Dharma so that all speaking may be dispelled. Therefore, buddha speech is unutterable.

source: །ཀླུའི་བདག་པོ་ང་ནི་རྣམ་པར་རིག་པར་བྱེད་པ་ལ་མངོན་པར་ཞེན་པར་བྱ་བའི་ཕྱིར་ཆོས་མི་སྟོན་མོད་ཀྱི།
en: Nāga Lord, I certainly do not teach the Dharma in order to arouse an obsession with communication.

source: འོན་ཀྱང་རྣམ་པར་རིག་པར་བྱེད་པ་དང་། ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: Rather, I teach the Dharma so that all communication and imagination can be pacified.

source: དེ་ལྟ་བས་ན་སངས་རྒྱས་ཀྱི་གསུང་ནི་རྣམ་པར་རིག་པར་བྱེད་པ་མ་ཡིན་ནོ།
en: Therefore, buddha speech is not communication.

source: །ཀླུའི་བདག་པོ་ང་ནི་ཆོས་གཟུང་བར་བྱ་བའི་ཕྱིར་དང་། ཆོས་ལ་མངོན་པར་ཞེན་པར་བྱ་བའི་ཕྱིར་དང་། ཆོས་སྤྲོས་པར་བྱ་བའི་ཕྱིར་དང་། ཆོས་ཡོངས་སུ་བརྟག་པར་བྱ་བའི་ཕྱིར་དང་། ཆོས་བསྐྱེད་པར་བྱ་བའི་ཕྱིར་དང་། ཆོས་དགག་པར་བྱ་བའི་ཕྱིར་དང་། ཆོས་རྣམ་པར་འཇིག་པར་བྱ་བའི་ཕྱིར་དང་། ཆོས་གནས་པར་བྱ་བའི་ཕྱིར་དང་། ཆོས་དམིགས་པར་བྱ་བའི་ཕྱིར་དང་། ཆོས་རློམ་སེམས་སུ་བྱ་བའི་ཕྱིར་དང་། ཆོས་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་ཕྱིར་དང་། ཆོས་བརྟག་པར་བྱ་བའི་ཕྱིར་དང་། ཆོས་མཚན་མར་བྱ་བའི་ཕྱིར་དང་། ཆོས་ལ་སྒྲིམ་པར་བྱ་བའི་ཕྱིར་དང་། ཆོས་འཆད་པར་བྱ་བའི་ཕྱིར་ཆོས་མི་སྟོན་ཏོ།
en: Nāga Lord, I certainly do not teach the Dharma so that phenomena may be grasped, so that phenomena may be clung to, so that phenomena may be elaborated on, so that phenomena may be imagined, so that phenomena may be produced, so that phenomena may be stopped, so that phenomena may be destroyed, so that phenomena may abide, so that phenomena may be observed, so that phenomena can be pondered, so that the essential nature of phenomena can be pointed out, so that phenomena may be analyzed, so that phenomena may be made manifest, so that phenomena can be striven after, or so that phenomena may be explained.

source: །ཀླུའི་བདག་པོ་ང་ནི་ཆོས་གང་ཡང་སྤང་བར་བྱ་བའམ། དགག་པར་བྱ་བའི་ཕྱིར་ཆོས་མི་སྟོན་མོད་ཀྱི།
en: Nāga Lord, I certainly do not teach the Dharma so that any phenomena can be abandoned or halted.

source: འོན་ཀྱང་ང་ནི་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྒྲོ་བཏགས་པ་མེད་པའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: Rather, I teach the Dharma precisely because all phenomena are naturally free from superimposition.

source: ཀླུའི་བདག་པོ་དེ་ལྟ་བས་ན་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྒྲོ་བཏགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་གསུང་ཞེས་བྱའོ།
en: “Therefore Nāga Lord, the fact that all phenomena are naturally free from superimposition can be called buddha speech

source: །ཅིའི་ཕྱིར་དེ་ལ་སངས་རྒྱས་ཀྱི་གསུང་ཞེས་བྱ་ཞེ་ན།
en: Why is this called buddha speech

source: ཚིག་ཐམས་ཅད་ཀྱི་ཚུལ་ནི་སངས་རྒྱས་ཡིན་ཏེ།
en: The nature of all words is buddhahood.

source: དེས་ན་སངས་རྒྱས་ཀྱི་གསུང་ཞེས་བྱའོ།
en: Therefore, they are called buddha speech

source: །ཚིག་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་ཡོངས་སུ་གཅོད་པ་ནི་སངས་རྒྱས་ཡིན་ཏེ།
en: The delimitation of the past and future of all words is buddhahood.

source: །ཚིག་ཐམས་ཅད་ཀྱི་ལྡེམ་པོར་དགོངས་པ་སྟོན་པ་ནི་སངས་རྒྱས་ཡིན་ཏེ།
en: The revelation of the indirect intention of all words is buddhahood.

source: །ཚིག་ཐམས་ཅད་ཀྱི་ལན་མཁྱེན་པ་ནི་སངས་རྒྱས་ཡིན་ཏེ།
en: The knowledge of the response to all words is buddhahood.

source: །ཚིག་ཐམས་ཅད་ཀྱི་རྒྱུ་དང་། དམིགས་པ་དང་། ཐ་སྙད་ནི་སངས་རྒྱས་ཡིན་ཏེ།
en: The causes, aims, and conventions of all words are buddhahood.

source: །ཚིག་ཐམས་ཅད་བྲག་ཅ་དང་འདྲ་བར་ཡང་གཞོལ་བར་མཁྱེན་པ་ནི་སངས་རྒྱས་ཡིན་ཏེ།
en: The knowledge that treats all words like echoes is buddhahood.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་ཡི་གེ་ཅི་ཡང་རུང་བ་དང་། ཚིག་ཅི་ཡང་རུང་བ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་གསུང་མ་ཡིན་པ་མེད་དོ།
en: “Nāga Lord, furthermore, there are no terms or words whatsoever that cannot be buddha speech.

source: ཡི་གེ་དེ་དག་ཉིད་ནི་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གསུངས་པ་དང་། གསུང་བ་དང་གསུང་བར་འགྱུར་བའི་ཕྱིར་རོ།
en: Because all those words have been spoken, are spoken, and will be spoken by the blessed buddhas of the past, present, and future.

source: །དེ་ལྟ་བས་ན་ཡི་གེ་ཐམས་ཅད་དང་། ཚིག་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་གསུང་ཡིན་ཏེ། དེ་ལྟ་བུའི་ཚིག་གི་དོན་དེ་ལ་འཇུག་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ།
en: Thus, all terms and words are buddha speech, and that which understands the meaning of such words is a bodhisattva’s correct understanding of meaning

source: །ཡི་གེ་ཐམས་ཅད་དང་། ཚིག་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་གསུང་ཡིན་ཏེ། དེ་ལ་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་ཅིང་རོ་གཅིག་པར་ཤེས་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ།
en: All terms and words are buddha speech, and that which knows them as the indivisibility and one taste of the realm of phenomena is a bodhisattva’s correct understanding of phenomena

source: །ཡི་གེ་ཐམས་ཅད་དང་། ཚིག་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་གསུང་ཡིན་ཏེ། དེ་ལ་ཅི་རིགས་པར་ཆོས་ལ་དཔྱོད་པ་ཤེས་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ།
en: All terms and words are buddha speech, and that knowledge of analyzing them in terms of the Dharma, as appropriate, is a bodhisattva’s correct understanding of language

source: །ཡི་གེ་ཐམས་ཅད་དང་ཚིག་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་གསུང་ཡིན་ཏེ། དེ་ལ་ཅི་རིགས་པའི་གནས་ལས་ཆགས་པ་མེད་པར་སྟོན་པ་ཤེས་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ།
en: All terms and words are buddha speech, and knowing how to teach without impediment based on the appropriate situation is a bodhisattva’s correct understanding of eloquence

source: །ཀླུའི་བདག་པོ་དེ་ལྟར་ན་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞིས་མ་བསྡུས་པའི་ཆོས་གང་ཡང་མེད་ལ།
en: Therefore, Nāga Lord, there are no phenomena that are not subsumed within these four correct discriminations.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཡི་གེ་ཅི་ཡང་རུང་བ་དེ་དང་། ཚིག་ཅི་ཡང་རུང་བ་དེ་དང་། ངེས་པའི་ཚིག་གང་ཡང་རུང་བ་གང་ཡིན་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་གསུང་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་འཇུག་སྟེ།
en: Bodhisattvas who attain these correct discriminations can understand the fact that any term, word, or language whatsoever is buddha speech.

source: དེས་ན་དེ་ནི་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པར་བསྐལ་པ་སྟོང་གི་བར་དུ་ཡང་སྟོན་ཅིང་འཆད་དེ་ཐོགས་པ་ཡང་མེད་དོ།
en: Thus they can teach and explain without any attachment or obstruction for up to a thousand eons, and there will be no hindrance.

source: ཀླུའི་བདག་པོ་འདི་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་གཟུངས་ཡིན་ཏེ།
en: Nāga Lord, this is the dhāraṇī called the inexhaustible casket

source: གཟུངས་དེ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚིག་དང་ཡི་གེ་མི་ཟད་པའི་མོས་པའི་ཚིག་ལེགས་པ་བྱས་པ་རྣམས་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་ཕན་ཚུན་གྱི་ཉེས་པ་སྤངས་པ་རྣམས་དང་། ཐོགས་པ་མེད་པ་རྣམས་དང་། འཐད་པ་རྣམས་དང་། ཀུན་རྫོབ་ཀྱི་བདེན་པས་བརྒྱན་པ་རྣམས་དང་། དོན་དམ་པ་དང་ལྡན་པ་རྣམས་དང་། རྟེན་རྣམ་པར་དག་པ་རྣམས་དང་། དྲང་བའི་དོན་དང་། ངེས་པའི་དོན་མཉམ་པར་རྟག་པ་རྣམས་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་གཞི་ཇི་ལྟ་བ་བཞིན་དུ་བསྟན་པ་རྣམས་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་འཇུག་པར་རྟོགས་པའི་བསྟན་པ་འཆད་པ་རྣམས་དང་། དབང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་རྐྱེན་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་རྣམས་དང་། ཡི་གེ་རྣམས་ཀྱིས་ཀྱང་ཆོས་དེ་དག་གླེང་བར་བྱེད་ན། འོན་ཀྱང་དེའི་ཡི་གེ་ཟད་པའམ། ཆོས་བརྗོད་པ་ཟད་པའམ། དཔེར་བྱ་བ་བཀོད་པ་ཟད་པའམ། དུས་བསྟན་པ་ཟད་པའམ།
en: Bodhisattvas who attain this dhāraṇī eloquently form felicitous statements in an inexhaustible flow of words and syllables. These statements do away with the faults of both the past and future. They are unobstructed, logical, and adorned with relative truth. They possess the ultimate, possess the pure foundation, and continually know both the provisional and definitive meaning.

source: རྒྱུ་དང་འབྲས་བུ་བསྟན་པ་ཟད་པའམ། ཚོད་དང་གནས་དང་མཚམས་ཟད་པའམ། སེམས་ཀྱི་འཇུག་པ་ཟད་པའམ། ཨ་ཞེས་བྱ་བའི་སྒོའི་ཚིག་ཟད་པའམ། ཨ་ཞེས་བྱ་བའི་མཚམས་སྦྱོར་བའི་ཚིག་ཟད་པའམ། དེ་བཞིན་དུ་སྦྱར་ཏེ། པ་ཞེས་བྱ་བའི་ཟད་པ་ནས་ལ་ཞེས་བྱ་བའི་བར་དུ་ཟད་པའམ།
en: They accurately demonstrate the ground of pollution and purification.

source: རྣམ་པར་བྱང་བ་རྣམ་པར་གཞག་པའི་བར་དུ་ཟད་པའམ།
en: They explain the teachings that allow one to understand the conduct of all beings.

source: ཆོས་ཀྱི་ངེས་པའི་ཚིག་གི་གཏམ་ཟད་པའམ། སྣ་ཚོགས་དང་ཟབ་མོའི་གཏམ་ཟད་པའམ། སྣྲེལ་ཞིའི་རྒྱུད་སྟོན་པའི་གཏམ་ཟད་པའམ། སྤྱིའུ་ཚུགས་དང་འཐུན་པའི་གཏམ་ཟད་པའམ།
en: They accurately discern the contributing conditions of the eighty-four thousand faculties

source: འཐུན་པ་དང་མི་འཐུན་པའི་གཏམ་ཟད་པའམ། ངེས་པའི་ཚིག་མེད་པའི་གཏམ་ཟད་པའམ། སངས་རྒྱས་དང་། ཆོས་དང་དགེ་འདུན་གྱི་ཡོན་ཏན་གྱི་བསྔགས་པ་བརྗོད་པ་ཟད་པའམ། བདེན་པ་བསྟན་པའི་གཏམ་ཟད་པའམ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་བསྟན་པའི་གཏམ་ཟད་པའམ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་བསྟན་པའི་གཏམ་ཟད་པའམ།
en: They use words when they present the teachings. However, they are inexhaustible when it comes to the use of terms and with regard to their Dharma lectures, usage of analogy, teachings on time, teachings on cause and effect, measures, subjects, limits, engagement of mind, initial syllables such as a, connecting syllables such as a , the presentations up to purification, discussions of the etymologies of the Dharma, varied and profound discussions, explanations of the connection between topics that are disordered, teachings that are in inverse order, discussions of the appropriate and the inappropriate, teachings devoid of etymologies, descriptions praising the qualities of the Buddha, Dharma, and Saṅgha, discussions teaching the truths, discussions teaching the factors of awakening, discussions describing the ripening of karma, and discussions teaching the perfections.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པའི་གཏམ་ཟད་པ་མེད་དོ། །ཀླུའི་བདག་པོ་དེ་ལྟར་ན་ཡི་གེ་ཐམས་ཅད་བསྟན་པ་ལ་ཟད་པ་མེད་པ། གང་ཡིན་པ་དེ་ནི་མི་ཟད་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་གཟུངས་ཞེས་བྱའོ།
en: “Therefore, Nāga Lord, the inexhaustibility in teaching any phoneme is the dhāraṇī called the inexhaustible casket

source: །ཀླུའི་བདག་པོ་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་ནི་མི་ཟད་པ་ཉིད་བཞིས་རྟོགས་པར་བྱ་སྟེ།
en: Nāga Lord, the inexhaustible casket dhāraṇī should be realized through the four inexhaustibilities.
